In [1]:
#Import dependencies
import pandas as pd
import matplotlib.pyplot as plt
import psycopg2
from sqlalchemy import create_engine

In [9]:
#Create sql engine
engine = create_engine('postgresql://postgres:postgres@localhost:5432/sql-challenge')

In [14]:
#Read tables into pandas
query = 'SELECT * FROM '
salaries = pd.read_sql_query(f'{query}salaries', engine)
titles = pd.read_sql_query(f'{query}titles', engine)

In [23]:
#Bin Salary data
bins = range(40000, 131000, 10000)
labels = ('40k-50k', '50k-60k', '60k-70k', '70k-80k', '80k-90k', '90k-100k', '100k-110k', '110k-120k', '>120k')
salaries['Income Range'] = pd.cut(salaries.salary, bins, labels=labels)
salaries.head()

   emp_no  salary   from_date     to_date Income Range
0   10001   60117  1986-06-26  1987-06-26      60k-70k
1   10002   65828  1996-08-03  1997-08-03      60k-70k
2   10003   40006  1995-12-03  1996-12-02      40k-50k
3   10004   40054  1986-12-01  1987-12-01      40k-50k
4   10005   78228  1989-09-12  1990-09-12      70k-80k